In [10]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [11]:
orders = pd.read_csv('./Orders.csv')
details = pd.read_csv('./Details.csv')

In [12]:
orders.head()

  Order ID  Order Date CustomerName             State     City Order Mode
0  B-25709  01-07-2018    Aakanksha    Madhya Pradesh   Indore     Online
1  B-25608  08-04-2018      Aarushi        Tamil Nadu  Chennai      Store
2  B-26081  22-03-2018      Aarushi        Tamil Nadu  Chennai     Online
3  B-26018  14-02-2018      Aarushi        Tamil Nadu  Chennai      Store
4  B-25830  26-10-2018       Aastha  Himachal Pradesh    Simla      Store

In [13]:
details.head()

,Order ID,Amount,Profit,Quantity,Category,Sub-Category,PaymentMode
0,B-25681,1096,658,7,Electronics,Electronic Games,COD
1,B-26055,5729,64,14,Furniture,Chairs,EMI
2,B-25955,2927,146,8,Furniture,Bookcases,EMI
3,B-26093,2847,712,8,Electronics,Printers,Credit Card
4,B-25602,2617,1151,4,Electronics,Phones,Credit Card

# Exploratory Data Analysis (EDA):

In [16]:
orders.info

<bound method DataFrame.info of     Order ID  Order Date CustomerName             State     City Order Mode
0    B-25709  01-07-2018    Aakanksha    Madhya Pradesh   Indore     Online
1    B-25608  08-04-2018      Aarushi        Tamil Nadu  Chennai      Store
2    B-26081  22-03-2018      Aarushi        Tamil Nadu  Chennai     Online
3    B-26018  14-02-2018      Aarushi        Tamil Nadu  Chennai      Store
4    B-25830  26-10-2018       Aastha  Himachal Pradesh    Simla      Store
..       ...         ...          ...               ...      ...        ...
495  B-25997  04-02-2018       Yogesh       Maharashtra     Pune     Online
496  B-25610  09-04-2018       Yogesh             Bihar    Patna      Store
497  B-26020  16-02-2018       Yogesh             Bihar    Patna      Store
498  B-26083  24-03-2018       Yogesh             Bihar    Patna     Online
499  B-25995  04-02-2018       Yohann             Delhi    Delhi      Store

[500 rows x 6 columns]>